{
	"version": "https://jsonfeed.org/version/1",
	"title": "Rhymes With Diploma",
	"icon": "https://micro.blog/tjluoma/avatar.jpg",
	"home_page_url": "https://www.rhymeswithdiploma.com/",
	"feed_url": "https://www.rhymeswithdiploma.com/feed.json",
	"items": [
		
		{
			"id": "http://tjluoma.micro.blog/2018/12/02/download-high-sierra.html",
	      	
			"title": "Download High Sierra",
			
			"content_html": "<p>In an unusual move, Apple has removed Sierra and High Sierra from the “Purchased” tab in the App Store, even if you had “purchased” and downloaded them previously.</p>\n\n<p>Links for OS X Lion, OS X Mountain Lion, OS X Mavericks, OS X Yosemite, and OS X El Capitan all remain in the “Purchased” tab, but Sierra and High Sierra are gone.</p>\n\n<p>Why? ` ¯_(ツ)_/¯ `</p>\n\n<p>Fortunately, it is still possible to download Sierra and High Sierra, if you have a direct link.</p>\n\n<p>You can find these through Apple‘s support site, but they are not always easy to find. For example, some Apple support pages which <em>previously</em> explained how to download <em>High Sierra</em> have been updated to explain how to download <em>Mojave</em>. (As if anyone would need help figuring out how to download Mojave when it is being advertised so heavily in the Mac App Store.)</p>\n\n<p>If you need or want to download Sierra / High Sierra, here are the links you can use:</p>\n\n<h2 id=\"high-sierra\">High Sierra</h2>\n\n<p>Official Support Page: &lt;<a href=\"https://support.apple.com/macos/high-sierra\">support.apple.com/macos/hig…</a>&gt;</p>\n\n<p>Mac App Store link: &lt;macappstore://itunes.apple.com/app/id1246284741&gt;</p>\n\n<p>iTunes/Web Browser: &lt;<a href=\"https://itunes.apple.com/us/app/macos-high-sierra/id1246284741?mt=12\">itunes.apple.com/us/app/ma…</a>&gt;</p>\n\n<h2 id=\"sierra\">Sierra</h2>\n\n<p>Official Support Page: &lt;<a href=\"https://support.apple.com/en-us/HT208202\">support.apple.com/en-us/HT2…</a>&gt;</p>\n\n<p>Mac App Store link: &lt;macappstore://itunes.apple.com/app/id1127487414&gt;</p>\n\n<p>iTunes/Web Browser: &lt;<a href=\"https://itunes.apple.com/us/app/macos-sierra/id1127487414?mt=12\">itunes.apple.com/us/app/ma…</a>&gt;</p>\n\n<p><em>(The “iTunes/Web Browser” links will just launch the App Store app, so you’re somewhat better off just using the <code class=\"highlighter-rouge\">macappstore</code> links, if they work.)</em></p>\n\n<h2 id=\"the-command-line-tool-mas\">The command-line tool <code class=\"highlighter-rouge\">mas</code></h2>\n\n<p>If you use <a href=\"https://github.com/mas-cli/mas\">mas</a> you should be able to download Sierra and High Sierra using these commands:</p>\n\n<p>To download Sierra:</p>\n\n<div class=\"highlighter-rouge\"><pre class=\"highlight\"><code>\tmas install 1127487414\n</code></pre>\n</div>\n\n<p>To download High Sierra:</p>\n\n<div class=\"highlighter-rouge\"><pre class=\"highlight\"><code>\tmas install 1246284741\n</code></pre>\n</div>\n\n<p>Note that <code class=\"highlighter-rouge\">mas</code> can usually only re-download apps that you have previously “bought” through the Mac App Store, so if you have never “bought” Sierra/High Sierra before, you may need to do that through the App Store app.</p>\n\n<h2 id=\"dont-panic\">Don’t Panic</h2>\n\n<p>I wouldn’t panic and say that Apple is going to make it impossible to download Sierra or High Sierra any time soon. After all, links to older versions of the OS are still readily available. Still, it <em>is</em> strange that these two were removed from the “Purchased” tab.</p>\n\n<p>I have downloaded both installers locally, just in case I need them in the future. (I‘m sticking with High Sierra for now anyway, and hoping that Mojave will <a href=\"https://www.shirt-pocket.com/blog/index.php/shadedgrey/comments/macos_mojave_opening_new_vistas_in_security_for_mac_users/\">outgrow its Windows Vista-ness</a> before I find myself needing to upgrade.)</p>\n",
			"date_published": "2018-12-02T17:15:12-05:00",
			"url": "https://www.rhymeswithdiploma.com/2018/12/02/download-high-sierra.html"
		},
		
		{
			"id": "http://tjluoma.micro.blog/2018/10/25/prevent-automatic-downloads.html",
	      	
			"title": "Prevent Automatic Downloads in macOS",
			
			"content_html": "<p>Quoting Apple’s own support document: <a href=\"https://support.apple.com/en-us/HT207251\">Prevent your Mac from downloading updates in the background</a></p>\n\n<blockquote>\n  <p>You can set your App Store preferences to “Download newly available updates in the background”. If you’re using OS X El Capitan v10.11.5 or later, these updates include major new macOS versions, like macOS Sierra. Your Mac then notifies you when the updates are ready to install.</p>\n</blockquote>\n\n<p>This is a not-good decision, Apple.</p>\n\n<p>There is a difference between these two things:</p>\n\n<ol>\n  <li>\n    <p>I want to automatically download updates to my computer.</p>\n  </li>\n  <li>\n    <p>I want to automatically download a 5+ GB new version of the operating system.</p>\n  </li>\n</ol>\n\n<p>And that difference is obvious to just about everyone.</p>\n\n<p>There ought to be a separate option for the latter choice.</p>\n\n",
			"date_published": "2018-10-25T17:31:04-04:00",
			"url": "https://www.rhymeswithdiploma.com/2018/10/25/prevent-automatic-downloads.html"
		},
		
		{
			"id": "http://tjluoma.micro.blog/2018/10/23/shortcut-open-in.html",
	      	
			"title": "Shortcut: Open in Browser",
			
			"content_html": "<p>It seemed simple enough, at first.</p>\n\n<p>I was looking at something on Amazon via the Amazon app, and I wanted to view it in Safari, instead of the app.</p>\n\n<p>Seems simple to you, too, right?</p>\n\n<p>Well, it wasn’t. First off, there was no Share item for “Open in Safari” which seemed odd. There was one for <a href=\"https://itunes.apple.com/us/app/icab-mobile-web-browser/id308111628?mt=8\">iCab</a> but not Safari.</p>\n\n<p>“Ok,” I thought, “I’ll just make a quick shortcut that will take the URL from the Amazon app and open in Safari.”</p>\n\n<p>That’s when things got weird.</p>\n\n<h3 id=\"where-would-you-like-to-go-where-would-you-like-to-go\">Where would you like to go? Where would you like to go?</h3>\n\n<p>I figured if I was going to make a shortcut to open the URL in Safari, I might as well make it offer to open in iCab and Chrome, too.</p>\n\n<p>The first thing that I noticed was that the page opened twice in Safari.</p>\n\n<p>It didn’t open at all in iCab.</p>\n\n<p>It didn’t open at all in Chrome.</p>\n\n<p>I added an “Alert” to show me exactly what was being sent to the browsers, and it was the URL from Amazon… twice.</p>\n\n<p>Why twice? I have no idea. If I used the Share link in the Amazon app to send to <a href=\"https://getdrafts.com\">Drafts</a>, I only got the URL once. But the shortcut was getting it twice.</p>\n\n<p>“Fine,” I thought, “I’ll just delete the second URL from the input.”</p>\n\n<p>Except I couldn’t figure out how to do that. So instead I settled on running a loop (“Repeat with Each” in Shortcuts), and putting an “Exit Shortcut” at the bottom of the block, so it will only process the URL once.</p>\n\n<h3 id=\"genius-i-thought-for-about-12-seconds\">“Genius!” I thought. For about 12 seconds.</h3>\n\n<p>After I managed to get the URL to only be sent once… it still didn’t work. I was sending the URL to iCab via x-callback-url, but it was launching, but the URL wasn’t opened (I’m completely willing to admit that might have been my fault for something I was doing wrong, but it seemed to work sometimes, and then stopped).</p>\n\n<p>Safari no longer opened the URL twice… but instead it immediately redirected me back to the Amazon app.</p>\n\n<p>Chrome worked fine.</p>\n\n<p><strong>ARGH.</strong></p>\n\n<p>I searched around for a way to stop Safari from doing that, but the only suggestion was to uninstall the Amazon app.</p>\n\n<p>Not helpful.</p>\n\n<p>Finally, I decided to implement a decidedly-stupid workaround which works: I created a small PHP page which will accept a URL as a query string, and then redirect the browser to that URL. If I send <em>that</em> to Safari, it will open the page as expected.</p>\n\n<h3 id=\"icab-and-1password\">iCab and 1Password</h3>\n\n<p>Something made me remember that I used to be able to send links from Safari to iCab by using a bookmarklet which changed “http:“ to “web:“ and “https:“ to “webs:“. I changed my shortcut (using “Replace Text”) to change those protocols before opening the URLs, and suddenly I could open the page in iCab too.</p>\n\n<p><em>That</em> made me remember that 1Password also had a way to open URLs in its built-in browser., but I couldn’t remember what it was, and “onepassword:” didn’t seem to work. However, a little Googling led me to a <a href=\"https://www.macstories.net/links/1password-4-1/\">MacStories post from 5½ years ago</a> which reminded me that the protocols I needed were “ophttp:” and “ophttps”.  I had a vague memory that 1Password had deprecated support for opening URLs this way, but it still works.</p>\n\n<h3 id=\"the-end-result\">The End Result</h3>\n\n<p>Finally, I have a shortcut that can take a URL (from Amazon’s app or anywhere else) and offers to open it in Safari, iCab, Chrome, or 1Password.</p>\n\n<p>You’re welcome to use it too, if you like. You can find it here: <a href=\"https://www.icloud.com/shortcuts/b1a04d9865ac431799668c15d785b66e\">Open In Browser (v.1.0)</a>.</p>\n\n<p>If I make changes/improvements to it, I’ll post those here and update the link.</p>\n\n",
			"date_published": "2018-10-23T14:44:58-04:00",
			"url": "https://www.rhymeswithdiploma.com/2018/10/23/shortcut-open-in.html"
		},
		
		{
			"id": "http://tjluoma.micro.blog/2018/10/15/due-schedule-call.html",
	      	
			"title": "Shortcut: Due Schedule Call",
			
			"content_html": "<p>I often want to set a reminder to call someone at a specific time.</p>\n\n<p>In the past, what I have done is gone to <a href=\"https://www.dueapp.com\">Due</a> and added a note which would say something like “Call AppleCare” and then set the time/date when I want to be reminded.</p>\n\n<p><em>(If you haven’t used Due, one of the things everyone loves about it is that it will keep reminding you to do something until you actually do it. You can have the reminders repeat every minute, every 5, 15, 30, etc. It’s the most-reliable way to get yourself to do something at a specific time or close to it.)</em></p>\n\n<p>The problem with my method has always been that the reminder would do off, and then I’d have to do to the phone app, look up the person I wanted to call, and then select the phone number.</p>\n\n<p>It’s that little bit of friction that doesn’t seem like much, but can make you resistant to actually doing the thing you need to do when the reminder goes off. Also, it’s easy (at least for me) to get distracted after I’ve dismissed the reminder from Due but before I actually make the call.</p>\n\n<h3 id=\"til-due-has-a-feature-to-make-this-easier\">TIL: Due has a feature to make this easier.</h3>\n\n<p>I’m sure this is mentioned in the documentation somewhere, but I stumbled across it by accident.</p>\n\n<p>I set a reminder in Due, but <em>this time</em> I added the phone number of the person I needed to call in the reminder in Due. When I dismissed the reminder in Due, it automatically prompted me to call the number.</p>\n\n<p><strong>Obviously, that’s much better.</strong></p>\n\n<p>Having the number <em>right there</em> means no searching for it, I can just do it. The friction has been removed.</p>\n\n<p>The only problem is that in order to do that, I needed to copy the phone number from my Contacts.app into Due.</p>\n\n<p>Which means that I <em>won’t</em> actually put the phone number into Due very often, even though I <em>know</em> it would make things easier for me later on.</p>\n\n<h3 id=\"complication-2-google-voice\">Complication #2: Google Voice</h3>\n\n<p><em>(Note: Even if you don’t use Google Voice, there is an option of this shortcut for you. Keep reading!)</em></p>\n\n<p>Adding to my resistance is the fact that many of the calls that I make are actually not made with via the iOS Phone.app.</p>\n\n<p>I use Google Voice for all of my calls related to my day-job, and I need/want to use Google Voice for those calls because then the caller-ID will show the phone number that work-related people have for me, instead of my actual iPhone number.</p>\n\n<p>So there’s <em>another</em> piece of friction.</p>\n\n<p>If only there was some way to make this easier…</p>\n\n<h3 id=\"cue-shortcuts\">Cue “Shortcuts”</h3>\n\n<p>As most of the people who are reading this probably know, Apple just introduced an app called “Shortcuts” which is basically version 2 of an app which was previously not-by-Apple. Version 1 of the app was called “Workflow”.</p>\n\n<p>I never really used Workflow much. Although Apple had approved it and let it into the App Store, I was <em>certain</em> that Apple would eventually kick it out of the App Store, and then I would be sad if I had built a bunch of things with it.</p>\n\n<p>Well, as it turns out, not only was I wrong, but I was wrong in about as big of a way as possible. Instead of kicking Workflow out of the App Store, Apple <em>bought</em> Workflow, and renamed it “Shortcuts” which is now available for iOS 12.</p>\n\n<p>Now that it is an official Apple app, I decided to start using it. But this was the first time that I had a problem that I really wanted to solve with automation on the iPhone:</p>\n\n<h3 id=\"how-can-i-make-it-easier-to-schedule-calls-on-my-iphone\">“How can I make it easier to schedule calls on my iPhone?”</h3>\n\n<p>I was poking around in Shortcuts when I realized that I could send the name and phone number of a contact to Due fairly easily.</p>\n\n<p>All I had to do was choose the person from my Contacts.app, and the shortcut could automatically copy the name <em>and</em> phone number, and sent both pieces of information to Due. Then all I had to do was pick a date/time for the reminder.</p>\n\n<p>But what about Google Voice? Unfortunately the official Google Voice app doesn’t support Shortcuts (yet?), but there is another iPhone app for Google Voice called <a href=\"http://gvconnect.com\">GV Connect</a> which has an URL scheme, meaning that we can use it with Shortcuts.</p>\n\n<h3 id=\"due-schedule-call\">“Due Schedule Call”</h3>\n\n<p>Putting all of this together, I made my first real Shortcut, which has 3 (or possibly 4) steps.</p>\n\n<ol>\n  <li>Select a contact from my contacts list</li>\n  <li>If the contact has more than one phone number, it will prompt you to choose which one to use.</li>\n  <li>Next it will ask if you want to use Google Voice or the regular Phone app</li>\n  <li>Finally it will send that information to Due, so you can set a time/date for the reminder.</li>\n</ol>\n\n<p>Step #2 was the last piece that I figured out. If I didn’t have some way to have the user choose a phone number, I was either left with the option of sending <em>all</em> of the phone numbers to Due (which was a terrible idea) or just automatically picking the first one (which wasn’t a great idea, although better than the previous alternative).</p>\n\n<p>After that, the real magic happens between steps 3 and 4, and it happens completely in the background.</p>\n\n<p>If I choose the Phone.app, the shortcut just sends the name and number to Due. But, if I choose Google Voice, the shortcut reformats the phone number into the proper syntax for GV Connect, and includes that in the reminder text that is sent to Due.</p>\n\n<p>By front-loading all of the decisions into the first part of the process (making the reminder), I have made it easier for Future-Me to actually make the phone call. It’s easier than it has ever been.</p>\n\n<p>When I “check off” the reminder, Due will let me trigger the call with almost zero effort.</p>\n\n<p><strong>For the first time <em>ever</em> it is <em>just as easy</em> for me to use Google Voice as it is to use the built-in Phone app!</strong><sup id=\"fnref:actually\"><a href=\"#fn:actually\" class=\"footnote\">1</a></sup></p>\n\n<h3 id=\"see-for-yourself\">See For Yourself</h3>\n\n<p>I made a short (about 1 minute) screencast of this shortcut in action.</p>\n\n<p>In it, I setup 2 reminders:</p>\n\n<ol>\n  <li>\n    <p>I selected a contact named “Apple” (which has multiple phone numbers) and scheduled a call to be made with the Phone app.</p>\n  </li>\n  <li>\n    <p>I selected a contact named “AppleCare” (which only has 1 phone number) and scheduled a call to be made via GV Connect.</p>\n  </li>\n</ol>\n\n<p>You can see it here:</p>\n\n<div style=\"padding:100% 0 0 0;position:relative;\"><iframe src=\"https://player.vimeo.com/video/295111732\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe></div>\n<script src=\"https://player.vimeo.com/api/player.js\"></script>\n\n<p>(Be sure to make it full-screen so you can see things more easily.)</p>\n\n<p>You can <a href=\"https://www.icloud.com/shortcuts/02041c70daf54044aa1e3cf3a055245a\">get the shortcut here</a>.</p>\n\n<h3 id=\"thanks\">Thanks</h3>\n\n<p>Thanks to Andreas Amann, GV Connect’s developer, who helped improve this shortcut.</p>\n\n<p>Thanks also to Raymond Velasquez who helped me solve another part of the puzzle via a post on &lt;<a href=\"https://talk.automators.fm\">talk.automators.fm</a>&gt;, which is a great place to get automation help for iOS or Mac.</p>\n\n<p>As a final side note: if you aren’t listening to <a href=\"https://www.relay.fm/automators\">Automators</a> with <a href=\"https://rosemaryorchard.com\">Rose Orchard</a> and <a href=\"https://www.macsparky.com\">David Sparks</a>, you really should be.</p>\n\n<h3 id=\"update-2018-10-13\">Update 2018-10-13</h3>\n\n<p>It occurs to me that this shortcut might be useful to more people if I offered a variant <em>without</em> the Google Voice portion. After all, if you don’t use Google Voice, there’s no sense in having to choose the phone app each time this shortcut runs.</p>\n\n<p>So I made a version without Google Voice. You can find it here:</p>\n\n<p><a href=\"https://www.icloud.com/shortcuts/06e9d83b9e4f471eb32a069da943bcf9\">Due Schedule Call (without Google Voice)</a></p>\n\n<hr />\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:actually\">\n      <p>In fact, it’s actually one less tap to use Google Voice rather than the regular phone app, because when you use the Phone app, Due offers to let you call or message the phone number, whereas with GV Connect I can specify that I want to make a call, not send an SMS. <a href=\"#fnref:actually\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-10-15T03:11:51-04:00",
			"url": "https://www.rhymeswithdiploma.com/2018/10/15/due-schedule-call.html"
		},
		
		{
			"id": "http://tjluoma.micro.blog/2018/10/15/he-really-needs.html",
	      	
			"content_html": "<p>He really needs to learn to relax.\n#shasta</p>\n\n<p><img src=\"http://tjluoma.micro.blog/uploads/2018/f047eeb94d.jpg\" width=\"600\" height=\"600\" /></p>\n",
			"date_published": "2018-10-15T01:10:28-04:00",
			"url": "https://www.rhymeswithdiploma.com/2018/10/15/he-really-needs.html"
		},
		
		{
			"id": "http://tjluoma.micro.blog/2018/10/15/if-you-are.html",
	      	
			"title": "Hello (micro.blog) World!",
			
			"content_html": "<p>If you are looking for older posts, they may be available at &lt;<a href=\"https://tjluoma.tumblr.com/\">tjluoma.tumblr.com</a>&gt;.</p>\n\n<p>I got fed up with Tumblr’s “quirks” and decided to try something new.</p>\n",
			"date_published": "2018-10-15T00:01:47-04:00",
			"url": "https://www.rhymeswithdiploma.com/2018/10/15/if-you-are.html"
		}
		
	]
}
